{
  "courses": [
    {
      "courseName": "Human-Computer Interaction",
      "courseCode": "INFR11017",
      "courseCredit": 20,
      "level": 11,
      "year": 4,
      "courseAverage": 78.86,
      "weightage": "70:30",
      "area": "Human Computer",
      "prerequisites": "None",
      "feedback": [
        "A very well-organised course for student who want to go into human-computer interaction or UX design.",
        "Great course. Although it has the reputation of being an \"easier\" course this mostly stems on the fact that you do not have to do as much programming. But don't take it for granted. You should carefully try to apply what you learned in the lectures in the assignments. It is not that easy after all and your intuition of what may be usable may sometimes not be correct.",
        "I'm surprised this course is not compulsory - I think everyone studying CS/AI/SE might have to create software/interfaces (e.g. for their dissertation projects) at some point. There's a lot of different methodologies and principles introduced throughout the course that are pretty straightforward and yet it would be hard to come up with them or find them on your own, I think. So it's a very useful course and the course lecturer, Dr. Kami Vaniea, makes the content interesting as well.",
        "It is different from the usual Computer Science courses but it is useful for work",
        " It's awesome, really different from what you've done before. Even if you don't want to do UI design, knowing HCI principles is really useful because in a work environment, you'll always need to make sure your work puts the user first.",
        "The lecture explain every knowledge point quite clear.",
        "Plan enough time for the coursework as it seems easy in the beginning, but requires much time to complete.",
        "Strongly recommend this course if student is interested in design.",
        "Take enough time to do the coursework, they are relatively easy but you want to plan carefully how much time you are going to spend on the various parts",
        "That find a good group partner because many programmers tend to be just interested in just programming and not the design (which is the most relevant in this course), at the end, you end up working yourself and not getting much feedback from your computer science partner.",
        "This course is a good way to think beyond the technical skills and to realize that everything we do as professionals is aimed to improve human experiences.",
        "To take it and to enjoy it! Definitely take it if your honours project involves any kind of HCI or user interaction",
        "You'd be surprised how useful it is. Oh, and the lecturer is great!",
        "Course helped me to understand how the design of computer related applications help user to interact with it.",
        "Courseworks - firstly, being introduced to some tools for software prototyping such as Proto.io, Figma or Processing and then getting to apply one of the evaluation methodologies in practice were both valuable experiences, which is hopefully going to be useful for my future projects.",
        "Dr Kami Vaniea's fantastic lecturing.",
        "I enjoyed the hands on tutorials that helped enforce the content in the course",
        "I find human computer interaction very interesting and would like to study it further.",
        "Interesting topics, motivated lecturer, great tutorials!",
        "It makes us appreciate how we can manage users' experience by following the various Principles.",
        "It structures and elaborates on knowledge essential for final year projects and any future studies we may wish or need to conduct.",
        "Kami's lectures are amazing! This course made me think about the user more and helped me get a different perspective on the way I think about ui design. Definitely a useful skill for the future.",
        "Lot of knowledge",
        "The lecturer is amazing and motivated. Kami takes time to answer questions and gives the feeling that there are no stupid questions.",
        "The lectures were interesting and the tutorials were great.",
        "The lectures where very clear and explained complex topics in adequate fashion. The coursework was very interesting, especially part 2",
        "The teacher, Kami. She is one of the most amazing lecturers I've had at this University since I came here 4 years ago.",
        "The theory accompanied by practice. Also, this course is different to other Computer Science courses, so it was quite refreshing.",
        "This course made me start thinking outside of the box which I think it's a very useful skill.",
        "the course that designing an interface is very interesting and helpful for me to understand the content of the lecture",
        "Coursework 1 had disappointingly uninformative feedback, and requirements for one of the tasks weren't clearly stated - only found out about them when we received our marks, which was way too late. So it was something me and my coursework partner got marked down although it wasn't an explicit expectation from us.",
        "For the group work, it'll be good if we can have the option to do individual work. There could also be an avenue to express if other group members are not contributing to the work.",
        "I found the order of the topics a little odd sometimes. For instance, when we had to design a usability study for the second assignment we hadn't talked about study design yet. Only a few days before the deadline. Maybe it would make more sense to talk about study design before talking about specific methods to use in a usability study?",
        "I think because of the complexity of the assignments it was difficult to get good feedback on the assignments. I think an instance to have a conversation with the markers will be good. It seems there are many markers as the class is very big, but that causes disconnection and is hard to understand why we did wrong",
        "I would suggest more clarification for coursework2 especially for the write-up section",
        "More challenging assignments? Maybe actually implement the app instead of just designing it?",
        "Not use learn to submit coursework.",
        "Nothing, pretty much keep it as it is.",
        "Please remove group work from the coursework assignments.",
        "There doesn't seem to be a cohesive structure to the course, meaning that the topic of some lectures felt a bit random. There could have been more coverage on the analysis of data, specifically for the purposes of the coursework",
        "There was a great issue with the marking of the first assignment which stemmed of the markers not understanding the criteria correctly. More clear marking schemes (and/or coursework handouts) would be useful to avoid such future issues.",
        "This class was taught at a very basic level which, I feel, was not a level 11 standard. I would have liked to go into much greater depth on many of the topics covered and did not think that the amount of time spent on certain topics was useful, especially as it was information that many people would already know and have covered in earlier levels of education. "
      ],
      "summary": "The design and implementation of efficient, effective and user friendly computer systems, including software objects and physical internet-enabled things, depends upon understanding both the technology and its users. Only then can designers be confident that these information appliances will be properly matched to the skills, knowledge and needs of their users. The study of Human-Computer Interaction (HCI) seeks to combine perspectives and methods of enquiry drawn from disciplines such as Interaction Design, Psychology and Sociology with the tools, techniques and technologies of Computer Science to create an approach to design which is both relevant and practical."
    },
    {
      "courseName": "Advanced Databases",
      "courseCode": "INFR11011",
      "level": 11,
      "year": 4,
      "courseAverage": 72.23,
      "weightage": "70:30",
      "area": "Databases",
      "prerequisites": "Database Systems",
      "feedback": [
        "Dr Paolo Guagliardo is great at explaining the material clearly. He also always pays attention whether the Media Hopper camera is on. This is really helpful if missed some lectures and also for the revision for the exam since, unfortunately, there are no pdf slides for this course. However, the course material is in alignment with the course book, which also gives nice explanations. Be aware this course is not about manipulating data in database but rather about the implementation of database management system (e.g. how dbms fetches data from a disk or various types of indexing). Coursework covered actual material of the course.",
        "Quality course, interesting material, well taught, would recommend.",
        "Clear explanation of how database works",
        "Dr Paolo Guagliardo explained everything very clearly and he always has examples prepared in advanced. Nice coursework which covered a great part of actual material of the course.",
        " Dr Paolo is a very good teacher, he explains everything very clearly and thoroughly. I liked him not having any slides, but rather using a small white board for the lectures.",
        "The lecture explain every knowledge point quite clear.",
        "The lecturer really seemed to care about the quality of his teaching, and it fully paid off",
        "The lectures are good.",
        "Have recommended readings to go along with lectures or course notes as currently the lectures are all done on the board with no lecture slides or anything to reinforce what you have seen in the lectures. Going back through lecture slides is a good way to revise but as there is no slides for this class, you would have to go and rewatch all the lectures which is much more time consuming.",
        "The lecturer wrote everything on the whiteboard. Although everything he wrote is on the recordings, it would be nice to have some slides. As mentioned above, Dr Paolo Guagliardo had always examples already prepared, so maybe he could make a pdf version of them in advance.",
        "Would be nice to have an outline of topics covered/ to be covered, with corresponding chapters from the textbook",
        "There was meant to be tutorials but the lecturer did not have rooms/times sorted to begin with and then they got cancelled due to the strikes so we only got 1 tutorial instead of 4 which is not good as I find tutorials to be very useful in preparing for the exam.The one tutorial we did have was very useful.",
        "There were supposed to be (only) 4 tutorials for the course. First one did not happen because of some organisation mistake made by ITO. Then, next two of them were cancelled due to the union strike and bad weather. Consequently, there was only one tutorial throughout the course. Unfortunately, I could not attend it but it was recorded."
      ],
      "courseCredit": 10,
      "summary": "This course aims at furthering database systems concepts through adding complexity and a more hands-on approach. In particular, we will focus on supporting multi-dimensional data in a DBMS, query optimisation, query evaluation, transaction processing and concurrency control in both a centralised and a distributed context. In terms of centralised databases, we shall start from single and multi-dimensional indexing methods, move on to join evaluation algorithms, and talk about query opimisation paradigms. We shall then focus on the issues of transaction processing, concurrency control and crash recovery. Finally, we shall revisit the previous issues in a distributed database environment."
    },
    {
      "courseName": "Operating Systems",
      "courseCode": "INFR09047",
      "level": 9,
      "year": 3,
      "courseAverage": 71.63,
      "weightage": "70:30",
      "area": "Computer Architecture",
      "prerequisites": "None",
      "feedback": [
        "Do the individual reading.",
        "Get ready for hours and hours of learning to understand errors from cpp gnu compiler and qemu. Expect the questions on the exam to be not really about OS but about ideas and fundamentals like scheduling in a weird essay formatted question, which if you are not native speaker have to read a few times to actually understand what it is after.",
        "Go for it, both the lectures and the coursework are quite enjoyable. Make sure you read the coursework assignments while well rested. It is somewhat difficult to understand at first but once you do, the implementation is reasonably straightforward.",
        "It's easy to follow and understand.",
        " Quite interesting and very good lecturers!",
        "Recommended",
        "Start the assignments early.",
        "Get started on the coursework early, as C++ and pointers can be quite confusing to wrap your head around! Also, make sure to use an IDE that will highlight pointer assignment inconsistencies :-)",
        "Interesting coursework, good lecturer",
        "The coursework assignments were challenging and gave me an idea of techniques of memory management, scheduling and file systems.",
        "The coursework in which included coding was the most valuable.",
        "The coursework was very challenging but helped give an idea on Operating Systems and their complexity.",
        "The courseworks were released from the start. The lectures were delivered very well.",
        "The lectures were really good at explaining the subject.",
        "The coursework is challenging and it's quite exciting to work on features that underlie the functioning of a system.",
        "Add some tutorials, maybe once every two weeks.",
        "I am not pleased that we didn't receive feedback from CW2 before submitting CW3. They are similar and I don't want to repeat stupid mistakes, for example if the marker wants me to comment or log more.",
        "I know it's probably hard to do it the proper way, but after doing the coursework assignments I didn't feel like that I, even partly, know how to do such a task because much of the complexity was abstracted away, either by the lecturer's provided code or by simplifying the task too much",
        "Provide more information for tasks to be completed in the coursework. Add tutorials and or workshops to practice exam questions in a group, practice c++ to train for coursework since c++ was never taught and that makes it difficult to do the coursework. Provide an environment where we can actually debug and test our code, the current system of writing and then getting compiler errors for error checking and searching through internet on how to fix some stuff just because it's c++ and qemu. An eclipse project with a configuration which runs the emulator and can debug the code is really helpful. Do this for next year students. Poor us.",
        "Recordings! There were NO recordings and I could not make it to most of them due to personal issues so I'm basically having to study everything without lectures.",
        "The code for the coursework is a bit of a mess in places. I would work on that a bit.",
        "The coursework was hard to get started on, as there was no help given regarding C++. Also, the lecturer speaks very fast."
      ],
      "courseCredit": 20,
      "summary": "This course provides an introduction to the design and implementation of general purpose multi-tasking operating systems. It concentrates on the kernel aspects of such systems with the emphasis being on concepts which lead to practical implementations. Throughout the course reference is made to a number of significant actual operating systems (Linux, Windows variants etc.) to illustrate real implementations.This 20 credit course replaces INFR09015 - Operating Systems (10 credits)."
    },
    {
      "courseName": "Advanced Topics in Foundations of Databases",
      "courseCode": "INFR11122",
      "courseCredit": 20,
      "level": 11,
      "year": 5,
      "courseAverage": 57.91,
      "weightage": "0:100",
      "area": "Databases",
      "prerequisites": "None",
      "feedback": [],
      "summary": "The course focuses on three central aspects of big data: Volume, Variety and Veracity. It will cover tractability and parallel scalability of querying big data (volume), data models and data interoperability (variety), and foundations of data quality and uncertainty (veracity). It aims to expose students to current research and development in connection with big data theory, and prepare them for conducting research in this emerging area. The course content is dynamic and continuously updated to cover the state-of-the-art in big data theory."
    },
    {
      "courseName": "Accelerated Natural Language Processing",
      "courseCode": "INFR11125",
      "courseCredit": 20,
      "level": 11,
      "year": 5,
      "courseAverage": 64.96,
      "weightage": "70:30",
      "area": "NLP",
      "prerequisites": "None",
      "feedback": [
        "Take this course and prepare to put lots of time in it, you will get the payback in terms of understanding more about natural language processing. The lecturer Sharon is very good.",
        "Make sure you already know how to program. - The probability tutorial should be compulsory before starting the course to aid later lectures” , “Although the class might seem very difficult at first, if you put the effort in, it will get easier with time. Depending on your background, it might feel impossible for the first few weeks, but just keep with it!",
        "Always keep updated.”, Make sure you deal with all the stuff required to cover. Don't lose confidence if you are also from linguistic background or other non-CS background.",
        "Assignments are challenging. So start early!",
        "Be prepare to study a lot and enjoy as you go.",
        "Definitely read up on some of the core J&M chapters, such as N-grams, HMMs and some coding practice with Python!",
        "I really enjoyed this course, I learned a lot. Although, I would highly recommend reading about linguistics before starting the course to make your life easier. It was very challenging, especially at the beginning.",
        "I will speak as a student with a linguistics background. Study the material before the first lecture. Not the whole book necessarily. At least the first chapters to have a head start so that you will be able to be prepared before the lectures. Some chapters might take longer to understand so it's good that you have started the book early.",
        "It's tough, but really rewarding and interesting.",
        "Keep up with notes during the term, depending on your background it can be a pretty straightforward course but there is a large volume of material you will need to know for the exam! Sharon is an exceptional lecturer. She is really engaging and obviously very knowledgeable and can make even some of the very dry introductory stuff interesting. It is a good course to take if you are look for an overview / introduction to NLP.",
        "Make a study group.",
        "Only take this course if you like linguistics, _and_ if you are not afraid to use mathematical concepts together with linguistics concepts. Prepare for each lecture/lab/tutorial in advance. It's important to keep up with the rhythm",
        "Review , Start early, try to keep up with the course content. You don't have to get deep understanding for each topic. Assignment 1 seems easy but people usually get less marks because of how they have written the reports.",
        "Start with the reading early!” , ”Stay on top of the material at all cost - it's called accelerated for a reason.",
        "Stay up to date with the lectures. If you miss one it's not the end of the world, but make sure to watch the recording.",
        "Study study study! Attend lectures, and give yourself plenty of time to revise before the exam. There's A LOT of information that's covered in this course.",
        "The one interested in natural language processing, and with basic programming skill.",
        "This course will probably make you feel dumb sometimes. The concepts can be really complex, but if you actually complete the tutorial problem sets, you'll learn a lot. I would absolutely recommend forming a study group to solve tutorial questions before the session. Talking through the problems with peers is really helpful, even if you don't get all the answers. Take advantage of online resources like the Jurafsky Martin YouTube series. Re-watch lectures-- it's amazing what the pause button will do for your understanding."
      ],
      "summary": "The course will synthesize ideas from linguistics and computer science to provide students with a fast-paced introduction to the field of natural language processing. The course will cover the most widely-used theoretical and computational models of language, including both statistical and nonstatistical approaches. The course will familiarize students with a wide range of linguistic phenomena with the aim of appreciating the complexity, but also the systematic behaviour of natural languages like English, the pervasiveness of ambiguity, and how this presents challenges in natural language processing. In addition, the course introduce the most important algorithms and data structures that are commonly used to solve many NLP problems. The course will cover formal models for representing and analyzing the syntax and semantics of words, sentences, and discourse. Students will learn how to analyse sentences algorithmically, using hand-crafted and automatically induced treebank grammars, and how to build interpretable semantic representations. The course will also cover a number of standard models and algorithms that are used throughout language processing. Examples include n-gram and Hidden Markov Models, the EM algorithm, and dynamic programming algorithms such as chart parsing. **This course replaces INFR11059 Advanced Natural Language Processing**"
    }
  ]
}