{
  "courses": [
    {
      "courseName": "Human-Computer Interaction",
      "courseCode": "INFR11017",
      "level": 11,
      "year": 4,
      "courseAverage": 78.86,
      "weightage": "70:30",
      "area": "Databases",
      "prerequisites": "None",
      "feedback": [
        "A very well-organised course for student who want to go into human-computer interaction or UX design.",
        "Great course. Although it has the reputation of being an \"easier\" course this mostly stems on the fact that you do not have to do as much programming. But don't take it for granted. You should carefully try to apply what you learned in the lectures in the assignments. It is not that easy after all and your intuition of what may be usable may sometimes not be correct.",
        "I'm surprised this course is not compulsory - I think everyone studying CS/AI/SE might have to create software/interfaces (e.g. for their dissertation projects) at some point. There's a lot of different methodologies and principles introduced throughout the course that are pretty straightforward and yet it would be hard to come up with them or find them on your own, I think. So it's a very useful course and the course lecturer, Dr. Kami Vaniea, makes the content interesting as well.",
        "It is different from the usual Computer Science courses but it is useful for work",
        " It's awesome, really different from what you've done before. Even if you don't want to do UI design, knowing HCI principles is really useful because in a work environment, you'll always need to make sure your work puts the user first.",
        "The lecture explain every knowledge point quite clear.",
        "Plan enough time for the coursework as it seems easy in the beginning, but requires much time to complete.",
        "Strongly recommend this course if student is interested in design.",
        "Take enough time to do the coursework, they are relatively easy but you want to plan carefully how much time you are going to spend on the various parts",
        "That find a good group partner because many programmers tend to be just interested in just programming and not the design (which is the most relevant in this course), at the end, you end up working yourself and not getting much feedback from your computer science partner.",
        "This course is a good way to think beyond the technical skills and to realize that everything we do as professionals is aimed to improve human experiences.",
        "To take it and to enjoy it! Definitely take it if your honours project involves any kind of HCI or user interaction",
        "You'd be surprised how useful it is. Oh, and the lecturer is great!",
        "Course helped me to understand how the design of computer related applications help user to interact with it.",
        "Courseworks - firstly, being introduced to some tools for software prototyping such as Proto.io, Figma or Processing and then getting to apply one of the evaluation methodologies in practice were both valuable experiences, which is hopefully going to be useful for my future projects.",
        "Dr Kami Vaniea's fantastic lecturing.",
        "I enjoyed the hands on tutorials that helped enforce the content in the course",
        "I find human computer interaction very interesting and would like to study it further.",
        "Interesting topics, motivated lecturer, great tutorials!",
        "It makes us appreciate how we can manage users' experience by following the various Principles.",
        "It structures and elaborates on knowledge essential for final year projects and any future studies we may wish or need to conduct.",
        "Kami's lectures are amazing! This course made me think about the user more and helped me get a different perspective on the way I think about ui design. Definitely a useful skill for the future.",
        "Lot of knowledge",
        "The lecturer is amazing and motivated. Kami takes time to answer questions and gives the feeling that there are no stupid questions.",
        "The lectures were interesting and the tutorials were great.",
        "The lectures where very clear and explained complex topics in adequate fashion. The coursework was very interesting, especially part 2",
        "The teacher, Kami. She is one of the most amazing lecturers I've had at this University since I came here 4 years ago.",
        "The theory accompanied by practice. Also, this course is different to other Computer Science courses, so it was quite refreshing.",
        "This course made me start thinking outside of the box which I think it's a very useful skill.",
        "the course that designing an interface is very interesting and helpful for me to understand the content of the lecture",
        "Coursework 1 had disappointingly uninformative feedback, and requirements for one of the tasks weren't clearly stated - only found out about them when we received our marks, which was way too late. So it was something me and my coursework partner got marked down although it wasn't an explicit expectation from us.",
        "For the group work, it'll be good if we can have the option to do individual work. There could also be an avenue to express if other group members are not contributing to the work.",
        "I found the order of the topics a little odd sometimes. For instance, when we had to design a usability study for the second assignment we hadn't talked about study design yet. Only a few days before the deadline. Maybe it would make more sense to talk about study design before talking about specific methods to use in a usability study?",
        "I think because of the complexity of the assignments it was difficult to get good feedback on the assignments. I think an instance to have a conversation with the markers will be good. It seems there are many markers as the class is very big, but that causes disconnection and is hard to understand why we did wrong",
        "I would suggest more clarification for coursework2 especially for the write-up section",
        "More challenging assignments? Maybe actually implement the app instead of just designing it?",
        "Not use learn to submit coursework.",
        "Nothing, pretty much keep it as it is.",
        "Please remove group work from the coursework assignments.",
        "There doesn't seem to be a cohesive structure to the course, meaning that the topic of some lectures felt a bit random. There could have been more coverage on the analysis of data, specifically for the purposes of the coursework",
        "There was a great issue with the marking of the first assignment which stemmed of the markers not understanding the criteria correctly. More clear marking schemes (and/or coursework handouts) would be useful to avoid such future issues.",
        "This class was taught at a very basic level which, I feel, was not a level 11 standard. I would have liked to go into much greater depth on many of the topics covered and did not think that the amount of time spent on certain topics was useful, especially as it was information that many people would already know and have covered in earlier levels of education. "
      ]
    }
  ]
}